*agv_ ejercicio ejemplo en clase (13nov2024)*

In [69]:
import numpy as np
import pandas as pd

In [70]:
df = pd.DataFrame(
    {'nombres':['Juan', 'Ronald', 'Carla', 'Nuria', 'Jose', 'Deni', None],
    'edades':[35, 36,28,19,25,'no lo dice', None],
    'dinero':[1000,5000,500,1_000_000,'no responde', 'casi  10000', None],
    'soy Nuria':[False,False, False, True, False, False, None],
    'IDs':[1,2,3,4,5,6,7]}
    )
df

  nombres      edades       dinero soy Nuria  IDs
0    Juan          35         1000     False    1
1  Ronald          36         5000     False    2
2   Carla          28          500     False    3
3   Nuria          19      1000000      True    4
4    Jose          25  no responde     False    5
5    Deni  no lo dice  casi  10000     False    6
6    None        None         None      None    7

Analizando los datos

In [71]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     6 non-null      object
 2   dinero     6 non-null      object
 3   soy Nuria  6 non-null      object
 4   IDs        7 non-null      int64
dtypes: int64(1), object(4)
memory usage: 412.0+ bytes

In [72]:
df.describe()

            IDs
count  7.000000
mean   4.000000
std    2.160247
min    1.000000
25%    2.500000
50%    4.000000
75%    5.500000
max    7.000000

In [73]:
df.describe(include='object')

       nombres  edades  dinero soy Nuria
count        6       6       6         6
unique       6       6       6         2
top       Juan      35    1000     False
freq         1       1       1         5

In [119]:
df['IDs'] = df['IDs'].astype('int8')

In [74]:
df

  nombres      edades       dinero soy Nuria  IDs
0    Juan          35         1000     False    1
1  Ronald          36         5000     False    2
2   Carla          28          500     False    3
3   Nuria          19      1000000      True    4
4    Jose          25  no responde     False    5
5    Deni  no lo dice  casi  10000     False    6
6    None        None         None      None    7

In [91]:
def solventar_dinero (x):      #para salvar el error al intentar calcular la media del dinero con valores no enteros
    if isinstance(x,(str)) or x == None:
        return pd.NA
    return x

In [92]:
solventar_dinero (None)

In [79]:
df['dinero'] = df['dinero'].apply(lambda x: 9999 if x == 'casi 10000' else x)

In [80]:
df

  nombres      edades       dinero soy Nuria  IDs
0    Juan          35         1000     False    1
1  Ronald          36         5000     False    2
2   Carla          28          500     False    3
3   Nuria          19      1000000      True    4
4    Jose          25  no responde     False    5
5    Deni  no lo dice  casi  10000     False    6
6    None        None         None      None    7

In [ ]:
df['dinero (€)'] = df['dinero (€)'].apply(lambda x: 9999 if x == 'casi 10000' else x)

In [104]:
df

  nombres      edades   dinero soy Nuria  IDs
0    Juan          35     1000     False    1
1  Ronald          36     5000     False    2
2   Carla          28      500     False    3
3   Nuria          19  1000000      True    4
4    Jose          25      NaN     False    5
5    Deni  no lo dice     9999     False    6
6    None        None     None      None    7

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     6 non-null      object
 2   dinero     5 non-null      object
 3   soy Nuria  6 non-null      object
 4   IDs        7 non-null      int64
dtypes: int64(1), object(4)
memory usage: 412.0+ bytes

In [106]:
df['soy Nuria'] = df['soy Nuria'].astype('Int32')

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     6 non-null      object
 2   dinero     5 non-null      object
 3   soy Nuria  6 non-null      Int32
 4   IDs        7 non-null      int64
dtypes: Int32(1), int64(1), object(3)
memory usage: 391.0+ bytes

In [ ]:
# df['soy Nuria'] = df['soy Nuria'].astype('int')

In [109]:
df['dinero'] = df['dinero'].astype('Int32')

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     6 non-null      object
 2   dinero     5 non-null      Int32
 3   soy Nuria  6 non-null      Int32
 4   IDs        7 non-null      int64
dtypes: Int32(2), int64(1), object(2)
memory usage: 370.0+ bytes

In [ ]:
# df['edades'] = df['edades'].astype('int')

In [112]:
df.loc[4, 'dinero'] = np.nan
df.loc[5, 'dinero'] = 9999

In [113]:
df

  nombres      edades   dinero  soy Nuria  IDs
0    Juan          35     1000          0    1
1  Ronald          36     5000          0    2
2   Carla          28      500          0    3
3   Nuria          19  1000000          1    4
4    Jose          25     <NA>          0    5
5    Deni  no lo dice     9999          0    6
6    None        None     <NA>       <NA>    7

In [115]:
#ahora con las edades, con otra cosa más bonita, dice Juan
df['edades'].replace('no lo dice',np.nan)

/var/folders/lh/mx1_xdkx76s1jt00m2qwl2km0000gn/T/ipykernel_57444/1159797429.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['edades'].replace('no lo dice',np.nan)

0    35.0
1    36.0
2    28.0
3    19.0
4    25.0
5     NaN
6     NaN
Name: edades, dtype: float64

In [ ]:
#ya que no me van a dejar en un futuro, cambio de metodo:
np.where()
#no funciona

In [114]:
df['edades'].at('no lo dice',np.nan)

TypeError: '_AtIndexer' object is not callable

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     6 non-null      object
 2   dinero     5 non-null      Int32
 3   soy Nuria  6 non-null      Int32
 4   IDs        7 non-null      int8
dtypes: Int32(2), int8(1), object(2)
memory usage: 321.0+ bytes

*agv_tenemos el punto 2.2 analisis de las variables y paso al punto 2.3 Cardinalidad*

In [116]:
(df.isnull().sum()/len(df))*100

nombres      14.285714
edades       14.285714
dinero       28.571429
soy Nuria    14.285714
IDs           0.000000
dtype: float64

In [118]:
for i in df:
    print(df[i].value_counts())

nombres
Juan      1
Ronald    1
Carla     1
Nuria     1
Jose      1
Deni      1
Name: count, dtype: int64
edades
35            1
36            1
28            1
19            1
25            1
no lo dice    1
Name: count, dtype: int64
dinero
1000       1
5000       1
500        1
1000000    1
9999       1
Name: count, dtype: Int64
soy Nuria
0    5
1    1
Name: count, dtype: Int64
IDs
1    1
2    1
3    1
4    1
5    1
6    1
7    1
Name: count, dtype: int64

In [125]:
len(df['nombres'].unique())/len(df) #cardinalidad del nombre

1.0

In [126]:
len(df['edades'].unique())/len(df) #cardinalidad de la edad

1.0

In [127]:
for i in df:
    print(i)
    print(len(df['edades'].unique())/len(df))

nombres
1.0
edades
1.0
dinero
1.0
soy Nuria
1.0
IDs
1.0